Revit 2027 API
Rebar.GetShapeDrivenAccessor Method
 Returns an interface providing access to shape-driven properties and methods for this Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeDrivenAccessor GetShapeDrivenAccessor()
Public Function GetShapeDrivenAccessor As RebarShapeDrivenAccessor
public:
RebarShapeDrivenAccessor^ GetShapeDrivenAccessor()
member GetShapeDrivenAccessor : unit -> RebarShapeDrivenAccessor
Return Value
RebarShapeDrivenAccessor
 The interface providing access to shape-driven properties and methods for this Rebar element.
Exceptions
Exception | Condition
InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace